#include <iostream>

using namespace std;

int main() {
//    Белочки и орешки - 1
//    N белочек нашли K орешков и решили разделить их поровну. Определите, сколько орешков достанется каждой белочке.

    int n, k;
    cin >> n >> k;
    cout << (k / n) << endl;
    return 0;
}
