#include <iostream>

using namespace std;

int main() {
//   Дано натуральное число, выведите его последнюю цифру.

    int n;
    cin >> n;
    cout << (n % 10) << endl;
    return 0;
}
